ceph/2hdd/cephfs_i01.log
4k_randwrite: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=1
4k_randread: (g=1): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=1
64k_write: (g=2): rw=write, bs=(R) 64.0KiB-64.0KiB, (W) 64.0KiB-64.0KiB, (T) 64.0KiB-64.0KiB, ioengine=libaio, iodepth=1
64k_read: (g=3): rw=read, bs=(R) 64.0KiB-64.0KiB, (W) 64.0KiB-64.0KiB, (T) 64.0KiB-64.0KiB, ioengine=libaio, iodepth=1
fio-3.7
Starting 4 processes
4k_randwrite: Laying out IO file (1 file / 5120MiB)
4k_randread: Laying out IO file (1 file / 5120MiB)
64k_write: Laying out IO file (1 file / 5120MiB)
64k_read: Laying out IO file (1 file / 5120MiB)

4k_randwrite: (groupid=0, jobs=1): err= 0: pid=7931: Mon Aug 17 15:11:35 2020
  write: IOPS=411, BW=1645KiB/s (1684kB/s)(48.2MiB/30003msec)
    slat (usec): min=9, max=4158, avg=18.59, stdev=49.60
    clat (usec): min=1242, max=21932, avg=2410.01, stdev=1116.06
     lat (usec): min=1260, max=21945, avg=2428.95, stdev=1116.78
    clat percentiles (usec):
     |  1.00th=[ 1598],  5.00th=[ 1827], 10.00th=[ 1942], 20.00th=[ 2057],
     | 30.00th=[ 2147], 40.00th=[ 2212], 50.00th=[ 2278], 60.00th=[ 2311],
     | 70.00th=[ 2409], 80.00th=[ 2474], 90.00th=[ 2606], 95.00th=[ 2737],
     | 99.00th=[10945], 99.50th=[10945], 99.90th=[12911], 99.95th=[13566],
     | 99.99th=[18482]
   bw (  KiB/s): min=  846, max= 1618, per=72.83%, avg=1197.37, stdev=159.78, samples=59
   iops        : min=  211, max=  404, avg=298.95, stdev=39.93, samples=59
  lat (msec)   : 2=14.57%, 4=82.97%, 10=1.24%, 20=1.21%, 50=0.01%
  cpu          : usr=0.30%, sys=0.83%, ctx=12341, majf=0, minf=10
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,12337,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
4k_randread: (groupid=1, jobs=1): err= 0: pid=9054: Mon Aug 17 15:11:35 2020
   read: IOPS=115, BW=460KiB/s (471kB/s)(13.5MiB/30006msec)
    slat (nsec): min=6621, max=69508, avg=26057.90, stdev=8743.81
    clat (usec): min=587, max=657034, avg=8654.14, stdev=19460.97
     lat (usec): min=602, max=657068, avg=8680.81, stdev=19461.56
    clat percentiles (usec):
     |  1.00th=[   963],  5.00th=[  2507], 10.00th=[  3064], 20.00th=[  4015],
     | 30.00th=[  5014], 40.00th=[  5932], 50.00th=[  6783], 60.00th=[  7832],
     | 70.00th=[  8848], 80.00th=[  9634], 90.00th=[ 10683], 95.00th=[ 16909],
     | 99.00th=[ 35390], 99.50th=[ 72877], 99.90th=[350225], 99.95th=[434111],
     | 99.99th=[658506]
   bw (  KiB/s): min=    6, max=  584, per=85.51%, avg=393.36, stdev=188.76, samples=59
   iops        : min=    1, max=  146, avg=97.97, stdev=47.25, samples=59
  lat (usec)   : 750=0.20%, 1000=0.98%
  lat (msec)   : 2=1.13%, 4=17.63%, 10=63.61%, 20=12.71%, 50=2.95%
  lat (msec)   : 100=0.46%, 250=0.14%, 500=0.14%, 750=0.03%
  cpu          : usr=0.14%, sys=0.36%, ctx=3454, majf=0, minf=11
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=3454,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
64k_write: (groupid=2, jobs=1): err= 0: pid=9526: Mon Aug 17 15:11:35 2020
  write: IOPS=377, BW=23.6MiB/s (24.7MB/s)(707MiB/30003msec)
    slat (usec): min=7, max=4492, avg=21.83, stdev=42.20
    clat (usec): min=1460, max=16452, avg=2627.57, stdev=789.50
     lat (usec): min=1485, max=16479, avg=2649.76, stdev=791.21
    clat percentiles (usec):
     |  1.00th=[ 1893],  5.00th=[ 2114], 10.00th=[ 2245], 20.00th=[ 2343],
     | 30.00th=[ 2442], 40.00th=[ 2507], 50.00th=[ 2540], 60.00th=[ 2606],
     | 70.00th=[ 2704], 80.00th=[ 2769], 90.00th=[ 2900], 95.00th=[ 2999],
     | 99.00th=[ 4817], 99.50th=[10945], 99.90th=[11994], 99.95th=[12911],
     | 99.99th=[15533]
   bw (  KiB/s): min= 8608, max=22423, per=73.62%, avg=17762.61, stdev=2041.13, samples=59
   iops        : min=  134, max=  350, avg=277.10, stdev=31.95, samples=59
  lat (msec)   : 2=2.25%, 4=96.40%, 10=0.78%, 20=0.57%
  cpu          : usr=0.31%, sys=0.85%, ctx=11315, majf=0, minf=11
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,11312,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
64k_read: (groupid=3, jobs=1): err= 0: pid=9944: Mon Aug 17 15:11:35 2020
   read: IOPS=675, BW=42.2MiB/s (44.2MB/s)(1266MiB/30001msec)
    slat (nsec): min=5840, max=71213, avg=17782.75, stdev=3739.49
    clat (usec): min=648, max=1464.9k, avg=1460.45, stdev=18758.77
     lat (usec): min=666, max=1464.0k, avg=1478.61, stdev=18758.97
    clat percentiles (usec):
     |  1.00th=[    742],  5.00th=[    791], 10.00th=[    816],
     | 20.00th=[    857], 30.00th=[    889], 40.00th=[    922],
     | 50.00th=[    963], 60.00th=[   1057], 70.00th=[   1156],
     | 80.00th=[   1221], 90.00th=[   1303], 95.00th=[   1369],
     | 99.00th=[   7242], 99.50th=[   9634], 99.90th=[  14615],
     | 99.95th=[  42730], 99.99th=[1468007]
   bw (  KiB/s): min=  128, max=60928, per=100.00%, avg=47789.42, stdev=18286.61, samples=53
   iops        : min=    2, max=  952, avg=746.68, stdev=285.73, samples=53
  lat (usec)   : 750=1.34%, 1000=53.66%
  lat (msec)   : 2=43.04%, 4=0.33%, 10=1.18%, 20=0.39%, 50=0.01%
  lat (msec)   : 100=0.01%, 250=0.01%, 500=0.02%
  cpu          : usr=0.47%, sys=1.39%, ctx=20256, majf=0, minf=27
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=20255,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=1645KiB/s (1684kB/s), 1645KiB/s-1645KiB/s (1684kB/s-1684kB/s), io=48.2MiB (50.5MB), run=30003-30003msec

Run status group 1 (all jobs):
   READ: bw=460KiB/s (471kB/s), 460KiB/s-460KiB/s (471kB/s-471kB/s), io=13.5MiB (14.1MB), run=30006-30006msec

Run status group 2 (all jobs):
  WRITE: bw=23.6MiB/s (24.7MB/s), 23.6MiB/s-23.6MiB/s (24.7MB/s-24.7MB/s), io=707MiB (741MB), run=30003-30003msec

Run status group 3 (all jobs):
   READ: bw=42.2MiB/s (44.2MB/s), 42.2MiB/s-42.2MiB/s (44.2MB/s-44.2MB/s), io=1266MiB (1327MB), run=30001-30001msec